"""Умный помощник в телеграме (ботик) Г ГАЗ

что умеет: под запросы клиента предложит модели автомобилей

дерево решений прорисовано пока в Миро, не буду здесь четкие вопросы переписывать, пожалуйста

на вход от пользователя: клики в опросе
на выходе: предложение подходящих под запросы автомобилей"""

"""Библиотеки: PyTelegramBotAPI, json, telegram.ext"""

#запустить сервер с ботом, подгрузить базу вопросов и решений

#принять сигнал с кнопки 'start' бота
#приветственное сообщение об умном помощнике

"""ДОП КНОПКИ в меню:
*связаться с менеджером
*перейти в шоурум
*help
"""

#1ая итерация - общий вопрос дерева
#считать сигнал кнопки - получение ответа от пользователя в опросе

#2ая итерация - пошли по ветке, зависит от ответа пользователя
#считать сигнал кнопки - получение ответа от пользователя в опросе

#.
#.
#.

#напомнить о себе, если не дошел пользователь до решения

#.
#.
#.

#nая итареция - получили ответ на последний вопрос ветки (всего их от 3ех до 5ти в зависимости от ветки)
#считать сигнал кнопки - получение ответа от пользователя в опросе

#отправить пользователю фотографии подходящих моделей автомобилей + характеристики и ссылка на сайте

#отправить сообщение о возможностях шоурума на сайте

#отправить сообщение и опрос с обратной связью/оценкой удовлетворенностью
#считать обратную связь


